app/controllers/pre_valuations_controller.rb

  def create
    @preValuation = PreValuation.new(pre_valuation_params)
    if @preValuation.save
---
INSERT INTO "pre_valuations" ("created_at", "preValuationAgentName", "preValuationComment", "preValuationNumber", "preValuationPolicyNumber", "preValuationSpecialConditions", "preValuationSubsection", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)